src/Catalogs/КартыДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>КартыДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Привязка</Name>
					<Comment>клиент, сотрудник, место</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдноразовоеИспользование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКартДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторHEX</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПосадочныеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПосадочныеМеста</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретНесколькихЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>для персональных мест</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммутироемоеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммутируемыеУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитнаяКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаМинимальнойПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросСуммыПредоплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретДовнесенияПредоплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИнтернетБронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Емкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лево</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Верх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанятоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтоТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоКоличествуПосетителей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КартыДоступа/Forms/Автозаполнение/module.bsl
Перем ВыбШаблон;

Процедура ЗакрытьНажатие(Элемент)
	Закрыть();
КонецПроцедуры

Процедура ЗаполнитьНажатие(Элемент)
	Если Не ЗначениеЗаполнено(Количество) Тогда
		Предупреждение("Укажите количество создаваемых карт!");
		Возврат;	
	КонецЕсли;
	
	Если ПрисвоениеКодов И Не ЗначениеЗаполнено(НачальныйКод) Тогда
		Предупреждение("Укажите начальный код карты!");
		Возврат;
	КонецЕсли;                                              
	
	Если ПрисвоениеКодов И НачальныйКод = "000000" Тогда
		Предупреждение("Начальный код задан не корректно!"); 
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьСвойИд И Не ЗначениеЗаполнено(Ид) Тогда
		Предупреждение("Укажите начальный идентификатор карты!");
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьСвойИд И ВыборШаблона = "EAN-13" И СтрДлина(СокрЛП(Префикс) + СокрЛП(Ид) + СокрЛП(Суффикс)) <> 12 Тогда
		Предупреждение("Количество знаков в шаблоне не соответствует EAN-13 (12 символов)!");
		Возврат;
	КонецЕсли;

	Если Вопрос("Создать карты доступа?", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПрисвоениеКодов Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	КартыДоступа.Код КАК Код
		|ИЗ
		|	Справочник.КартыДоступа КАК КартыДоступа
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ");
		Выгрузка = Запрос.Выполнить().Выгрузить();
		Если Выгрузка.Количество()>0 Тогда
			ТекКод = Формат(Число(Выгрузка[0].Код) +1,"ЧГ=0");
		Иначе 
			ТекКод = 1;
		КонецЕсли;
	Иначе
		ТекКод = Формат(Число(НачальныйКод), "ЧГ=0");
	КонецЕсли;
	
	НачатьТранзакцию();
	
	ТекИд = Ид;
	Для Номер = 1 По Количество Цикл                       			
		
		Карта = Справочники.КартыДоступа.СоздатьЭлемент();
		Карта.Родитель = ВыбГруппа;
		// < КС_ВДВ -------------------------------------------------------------------- 
		Карта.ТипКарты = ТипКарт;
		// КС_ВДВ > -------------------------------------------------------------------- 
		Если ПрисвоениеКодов Тогда
			Код = ФорматироватьКод(Строка(ТекКод));
			Карта.Код = Код;
			ТекКод = Формат(Число(ТекКод) + 1, "ЧГ=0");
		Иначе
			Карта.Код = ФорматироватьКод(Строка(ТекКод));;
			ТекКод = Формат(Число(ТекКод) + 1, "ЧГ=0");
		КонецЕсли;	
		
		Если ИспользоватьСвойИд Тогда
			КолСимволов = СтрДлина(СокрЛП(Ид));
			
			Если ВыборШаблона = "EAN-13" Тогда
			    Карта.Идентификатор = СформироватьШК(СокрЛП(Префикс) + СокрЛП(ТекИд) + СокрЛП(Суффикс));
			Иначе
				Карта.Идентификатор = СокрЛП(Префикс) + СокрЛП(ТекИд) + СокрЛП(Суффикс);
			КонецЕсли;
			
			ТекИд = Формат(Число(ТекИд) + 1, "ЧГ=0"); 
			Пока СтрДлина(СокрЛП(ТекИд)) < КолСимволов Цикл
				ТекИд = "0" + СокрЛП(ТекИд);
			КонецЦикла;	
			
		Иначе
			Карта.Идентификатор = Карта.Код;
			
		КонецЕсли;	
		
		Если ЗадатьПериод Тогда
			Карта.Дата1 = ДатаС;
			Карта.Дата2 = ДатаПо;
		КонецЕсли;
		
		Если СоздаватьКлиента тогда
			Карта.Наименование = "Клиент "+(счетчикНачало+номер);
		иначе
			Карта.Наименование = "Карта № " + Карта.Код;
		КонецЕсли;
		
		Попытка
			Карта.Записать();
		Исключение
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
		
		Если СоздаватьКлиента тогда
			Клиент = Справочники.Клиенты.СоздатьЭлемент();
			Клиент.Родитель = КлиентРодитель;
			Клиент.Наименование = "Клиент "+(счетчикНачало+номер);
			Клиент.Записать();
			
			Карта.Привязка = Клиент.Ссылка;
			Карта.Записать();
		КонецЕсли;
		
		Стр = Результат.Добавить();
		Стр.Ссылка = Карта.Ссылка;		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	Закрыть();
КонецПроцедуры

Процедура ПрисвоениеКодовПриИзменении(Элемент)
	УправлениеФормой();	
КонецПроцедуры

Процедура ИспользоватьСвойИдПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

Процедура ПриОткрытии()
	УправлениеФормой();
КонецПроцедуры

Процедура ЗадатьПериодПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

Процедура УправлениеФормой()
	ЭлементыФормы.НачальныйКод.Доступность		= ПрисвоениеКодов;
	ЭлементыФормы.НадписьПрефикс.Доступность	= ИспользоватьСвойИд;
	ЭлементыФормы.НадписьСуффикс.Доступность	= ИспользоватьСвойИд;
	ЭлементыФормы.НадписьНачИд.Доступность		= ИспользоватьСвойИд;
	ЭлементыФормы.Префикс.Доступность			= ИспользоватьСвойИд;
	ЭлементыФормы.Суффикс.Доступность			= ИспользоватьСвойИд;
	ЭлементыФормы.Ид.Доступность				= ИспользоватьСвойИд;
	ЭлементыФормы.ВыборШаблона.Доступность		= ИспользоватьСвойИд;
	ЭлементыФормы.НадписьС.Доступность			= ЗадатьПериод;
	ЭлементыФормы.НадписьПо.Доступность			= ЗадатьПериод;
	ЭлементыФормы.ДатаС.Доступность				= ЗадатьПериод;
	ЭлементыФормы.ДатаПо.Доступность			= ЗадатьПериод;
	
КонецПроцедуры

Процедура КнопкаВыборПериодаНажатие(Элемент)
	ИнтерфейсАдмина.ВыборПериода(ДатаС, ДатаПо);
КонецПроцедуры

Процедура РезультатВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если Не Колонка.Имя = "Владелец" Тогда
		ВыбраннаяСтрока.Ссылка.ПолучитьФорму().ОткрытьМодально();
	Иначе
		Список = Новый СписокЗначений;
		Список.Добавить("Сотрудники");
		Список.Добавить("Клиенты");
		Список.Добавить("Посадочные места");
		
		Кто = ВыбратьИзМеню(Список);
		Если Кто = Неопределено Тогда 
			Возврат;
		ИначеЕсли Кто.Значение = "Сотрудники" Тогда
			ФормаВыбора = Справочники.Сотрудники.ПолучитьФормуВыбора();
		ИначеЕсли  Кто.Значение = "Клиенты" Тогда
			ФормаВыбора = Справочники.Клиенты.ПолучитьФормуВыбора();
		ИначеЕсли  Кто.Значение = "Посадочные места" Тогда
			ФормаВыбора = Справочники.ПосадочныеМеста.ПолучитьФормуВыбора();
		КонецЕсли;
		
		Владелец = ФормаВыбора.ОткрытьМодально();
		
		Если ЗначениеЗаполнено(Владелец) Тогда
			Объект = ВыбраннаяСтрока.Ссылка.ПолучитьОбъект();
			Объект.Привязка = Владелец;
			Попытка
				Объект.Записать();	
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура РезультатПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	ДанныеСтроки.Код = ДанныеСтроки.Ссылка.Код;
	ДанныеСтроки.Идентификатор = ДанныеСтроки.Ссылка.Идентификатор;
	ДанныеСтроки.Владелец = ДанныеСтроки.Ссылка.Привязка;
КонецПроцедуры

Процедура НачальныйКодПриИзменении(Элемент)
	Элемент.Значение = ФорматироватьКод(Элемент.Значение);
КонецПроцедуры

Функция  ФорматироватьКод(Код)	
	
	Пока СтрДлина(СокрЛП(Код)) < 6 Цикл
		Код = "0" + СокрЛП(Код);
	КонецЦикла;	
	Возврат Код;	
КонецФункции
